# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

month = int(input("Введите месяц от 1 до 12: "))
months_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
months_dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень",
               10: "осень", 11: "осень", 12: "зима"}
if 1 <= month <= 12:
    print(f"Сейчас {months_list[month - 1]}")
else:
    print(f"В году 12 месяцев, месяца №{month} не существует")